<script setup lang="ts">
const h1Class = "text-2xl text-primary font-bold";
const h2Class = "text-xl font-bold";
const ulClass = "list-disc ml-5";
</script>

<template>
  <div class="flex flex-col gap-5">
    <h1 :class="h1Class">利用規約</h1>
    <p>この利用規約（以下、「本規約」といいます。）は、ColabHub（以下、「当サイト」といいます。）が提供するサービス（以下、「本サービス」といいます。）の利用条件を定めるものです。ご利用の皆さま（以下、「ユーザー」といいます。）には、本規約に従って本サービスをご利用いただきます。</p>

    <h2 :class="h2Class">第1条（適用）</h2>
    <p>本規約は、ユーザーと当サイトとの間の本サービスの利用に関わる一切の関係に適用されます。</p>

    <h2 :class="h2Class">第2条（利用登録）</h2>
    <p>ユーザーは、Googleアカウントを使用して登録することで、本サービスを利用することができます。</p>

    <h2 :class="h2Class">第3条（禁止事項）</h2>
    <p>ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません：</p>
    <ul :class="ulClass">
      <li>法令または公序良俗に違反する行為</li>
      <li>他のユーザーまたは第三者に不利益や損害を与える行為</li>
      <li>虚偽の情報を登録する行為</li>
    </ul>

    <h2 :class="h2Class">第4条（本サービスの提供の停止）</h2>
    <p>当サイトは、システムの保守点検や緊急時のために、ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止することができます。</p>

    <h2 :class="h2Class">第5条（利用制限および登録抹消）</h2>
    <p>当サイトは、以下の場合には、事前の通知なく、ユーザーに対して本サービスの利用を制限、または登録を抹消することができます：</p>
    <ul :class="ulClass">
      <li>本規約に違反した場合</li>
      <li>登録内容に虚偽の事実があることが判明した場合</li>
    </ul>

    <h2 :class="h2Class">第6条（免責事項）</h2>
    <p>当サイトは、本サービスに関してユーザーに生じた損害について一切の責任を負いません。</p>

    <h2 :class="h2Class">第7条（規約の変更）</h2>
    <p>当サイトは、必要と判断した場合には、ユーザーに通知することなく本規約を変更できるものとします。</p>

    <h2 :class="h2Class">第8条（準拠法・裁判管轄）</h2>
    <p>本規約の解釈にあたっては、日本法を準拠法とします。また、本サービスに関して紛争が生じた場合には、東京地方裁判所を専属的合意管轄とします。</p>

    <p class="mt-5">最終更新日：2025年6月7日</p>
  </div>
</template>

<style scoped>
</style>